In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from scipy.stats import norm
import matplotlib.pyplot as plt
import math
import plotly.express as px
import requests

import matplotlib.pyplot as plt
import matplotlib.patches as patches

import pandasql as ps

In [2]:
data = pd.read_csv('residente.csv')
data.head(10)

,UPM,VIV_SEL,HOGAR,NUM_REN,PAREN,SEXO,EDAD,DIA,MES,P3_7,...,P3_10,P3_11,P3_12,FAC_HOGAR,UPM_DIS,EST_DIS,DOMINIO,TLOC,ESTRATO,ENT
0,100023,1,1,1,1,2,41,16.0,9.0,2.0,...,1.0,NaN,1.0,174,1,7,U,1,3,1
1,100023,2,1,1,1,1,46,2.0,9.0,2.0,...,7.0,NaN,NaN,174,1,7,U,1,3,1
2,100023,2,1,2,2,2,47,5.0,9.0,2.0,...,6.0,4.0,NaN,174,1,7,U,1,3,1
3,100023,2,1,3,3,2,23,22.0,1.0,2.0,...,1.0,NaN,1.0,174,1,7,U,1,3,1
4,100023,2,1,5,3,2,17,22.0,10.0,1.0,...,5.0,4.0,NaN,174,1,7,U,1,3,1
5,100023,2,1,6,3,1,13,25.0,8.0,1.0,...,5.0,4.0,NaN,174,1,7,U,1,3,1
6,100023,2,1,4,3,2,21,17.0,9.0,2.0,...,6.0,4.0,NaN,174,1,7,U,1,3,1
7,100023,3,1,1,1,2,50,5.0,6.0,2.0,...,1.0,NaN,1.0,174,1,7,U,1,3,1
8,100023,3,1,2,3,2,19,5.0,6.0,1.0,...,1.0,NaN,1.0,174,1,7,U,1,3,1
9,100023,4,1,1,1,1,56,16.0,8.0,2.0,...,1.0,NaN,4.0,174,1,7,U,1,3,1

In [3]:
A=data.UPM.astype(str)
B=data.VIV_SEL.astype(str)
C = A+B
data['code']=C

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205909 entries, 0 to 205908
Data columns (total 26 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   UPM        205909 non-null  int64
 1   VIV_SEL    205909 non-null  int64
 2   HOGAR      205909 non-null  int64
 3   NUM_REN    205909 non-null  int64
 4   PAREN      205909 non-null  int64
 5   SEXO       205909 non-null  int64
 6   EDAD       205909 non-null  int64
 7   DIA        188483 non-null  float64
 8   MES        188483 non-null  float64
 9   P3_7       188483 non-null  float64
 10  NIVEL      188483 non-null  float64
 11  GRADO      188483 non-null  float64
 12  P3_9_1     188483 non-null  float64
 13  P3_9_2     188483 non-null  float64
 14  P3_9_3     188483 non-null  float64
 15  P3_10      167614 non-null  float64
 16  P3_11      73372 non-null   float64
 17  P3_12      98843 non-null   float64
 18  FAC_HOGAR  205909 non-null  int64
 19  UPM_DIS    205909 non-null  int64
 20  EST_DIS    205909 non-null  int64
 21  DOMINIO    205909 non-null  object
 22  TLOC       205909 non-null  int64
 23  ESTRATO    205909 non-null  int64
 24  ENT        205909 non-null  int64
 25  code       205909 non-null  object
dtypes: float64(11), int64(13), object(2)
memory usage: 40.8+ MB

In [5]:
data1 = data.iloc[:,[4,5,6,9,10,11,12,13,14,19,20,21,22,23,24,25]]
data1.head(10)

,PAREN,SEXO,EDAD,P3_7,NIVEL,GRADO,P3_9_1,P3_9_2,P3_9_3,UPM_DIS,EST_DIS,DOMINIO,TLOC,ESTRATO,ENT,code
0,1,2,41,2.0,10.0,2.0,1.0,1.0,1.0,1,7,U,1,3,1,1000231
1,1,1,46,2.0,6.0,3.0,2.0,1.0,1.0,1,7,U,1,3,1,1000232
2,2,2,47,2.0,3.0,3.0,2.0,1.0,1.0,1,7,U,1,3,1,1000232
3,3,2,23,2.0,6.0,3.0,1.0,1.0,1.0,1,7,U,1,3,1,1000232
4,3,2,17,1.0,6.0,2.0,1.0,1.0,1.0,1,7,U,1,3,1,1000232
5,3,1,13,1.0,3.0,1.0,1.0,1.0,1.0,1,7,U,1,3,1,1000232
6,3,2,21,2.0,6.0,3.0,1.0,1.0,1.0,1,7,U,1,3,1,1000232
7,1,2,50,2.0,8.0,4.0,1.0,1.0,1.0,1,7,U,1,3,1,1000233
8,3,2,19,1.0,8.0,1.0,1.0,1.0,1.0,1,7,U,1,3,1,1000233
9,1,1,56,2.0,2.0,6.0,2.0,1.0,1.0,1,7,U,1,3,1,1000234

In [6]:
data1.to_csv('residente_limpio.csv')

In [7]:
data2 = pd.read_csv('vivienda.csv')
data2

,UPM,VIV_SEL,P1_1,P1_2,P1_3,P1_4,P1_5_1,P1_5_2,P1_5_3,P2_1,P2_2,P2_3,FAC_VIV,UPM_DIS,EST_DIS,DOMINIO,TLOC,ESTRATO,ENT
0,100023,1,3,1,1,1,1,1,1,1,1,NaN,174,1,7,U,1,3,1
1,100023,2,3,1,1,1,1,1,1,6,1,NaN,174,1,7,U,1,3,1
2,100023,3,3,1,1,1,1,1,1,2,1,NaN,174,1,7,U,1,3,1
3,100023,4,3,1,1,1,1,1,2,9,1,NaN,174,1,7,U,1,3,1
4,100023,5,3,1,1,1,1,1,2,3,1,NaN,174,1,7,U,1,3,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
58276,3260794,15,2,1,2,1,1,2,2,3,1,NaN,190,8235,337,R,4,1,32
58277,3260794,16,2,2,2,1,1,2,2,3,1,NaN,190,8235,337,R,4,1,32
58278,3260794,18,2,2,2,1,1,1,2,3,1,NaN,190,8235,337,R,4,1,32
58279,3260794,19,2,3,2,1,1,2,2,1,1,NaN,190,8235,337,R,4,1,32
58280,3260794,20,2,1,2,1,1,1,2,1,1,NaN,190,8235,337,R,4,1,32

In [8]:
A=data2.UPM.astype(str)
B=data2.VIV_SEL.astype(str)
C = A+B
data2['code']=C

In [9]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58281 entries, 0 to 58280
Data columns (total 20 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   UPM      58281 non-null  int64
 1   VIV_SEL  58281 non-null  int64
 2   P1_1     58281 non-null  int64
 3   P1_2     58281 non-null  int64
 4   P1_3     58281 non-null  int64
 5   P1_4     58281 non-null  int64
 6   P1_5_1   58281 non-null  int64
 7   P1_5_2   58281 non-null  int64
 8   P1_5_3   58281 non-null  int64
 9   P2_1     58281 non-null  int64
 10  P2_2     58281 non-null  int64
 11  P2_3     849 non-null    float64
 12  FAC_VIV  58281 non-null  int64
 13  UPM_DIS  58281 non-null  int64
 14  EST_DIS  58281 non-null  int64
 15  DOMINIO  58281 non-null  object
 16  TLOC     58281 non-null  int64
 17  ESTRATO  58281 non-null  int64
 18  ENT      58281 non-null  int64
 19  code     58281 non-null  object
dtypes: float64(1), int64(17), object(2)
memory usage: 8.9+ MB

In [10]:
data3 = data2.iloc[:,[2,3,4,5,6,7,8,9,10,11,18,19]]
data3.head()

,P1_1,P1_2,P1_3,P1_4,P1_5_1,P1_5_2,P1_5_3,P2_1,P2_2,P2_3,ENT,code
0,3,1,1,1,1,1,1,1,1,NaN,1,1000231
1,3,1,1,1,1,1,1,6,1,NaN,1,1000232
2,3,1,1,1,1,1,1,2,1,NaN,1,1000233
3,3,1,1,1,1,1,2,9,1,NaN,1,1000234
4,3,1,1,1,1,1,2,3,1,NaN,1,1000235

In [11]:
data4 = pd.read_csv('hogar.csv')
data4.head(10)

C:\Users\G4BR1\AppData\Local\Temp\ipykernel_18780\438621187.py:1: DtypeWarning: Columns (29) have mixed types. Specify dtype option on import or set low_memory=False.
  data4 = pd.read_csv('hogar.csv')

,UPM,VIV_SEL,HOGAR,P4_1_1,P4_1_2,P4_1_3,P4_1_4,P4_1_5,P4_1_6,P4_1_6_1,...,P5_11_1,P5_11_2,P5_11_3,FAC_HOG,UPM_DIS,EST_DIS,DOMINIO,TLOC,ESTRATO,ENT
0,100023,1,1,1,2,2,1,2,1,1.0,...,3.0,3.0,3.0,174,1,7,U,1,3,1
1,100023,2,1,2,2,2,1,2,1,5.0,...,2.0,1.0,1.0,174,1,7,U,1,3,1
2,100023,3,1,2,1,2,1,1,1,2.0,...,1.0,1.0,1.0,174,1,7,U,1,3,1
3,100023,4,1,1,2,2,1,1,1,8.0,...,1.0,1.0,1.0,174,1,7,U,1,3,1
4,100023,5,1,2,2,2,1,2,1,3.0,...,2.0,3.0,3.0,174,1,7,U,1,3,1
5,100029,1,1,2,2,2,1,2,1,3.0,...,1.0,1.0,1.0,222,2,6,U,1,2,1
6,100029,2,1,1,1,2,1,1,1,3.0,...,1.0,3.0,1.0,222,2,6,U,1,2,1
7,100029,3,1,1,1,2,1,2,1,5.0,...,3.0,3.0,3.0,222,2,6,U,1,2,1
8,100029,5,1,2,2,2,1,2,1,2.0,...,1.0,1.0,1.0,222,2,6,U,1,2,1
9,100037,1,1,1,1,2,2,2,1,4.0,...,1.0,2.0,1.0,169,3,7,U,1,3,1

In [12]:
A=data4.UPM.astype(str)
B=data4.VIV_SEL.astype(str)
C = A+B
data4['code']=C

In [13]:
data5 = data4.iloc[:,[2,3,4,5,6,7,8,9,10,11,12,14,16,30,50,74,84]]

In [14]:
bruto1=pd.merge(data3, data5, on='code', suffixes=('_vive','_hogar'))

In [15]:
bruto1

,P1_1,P1_2,P1_3,P1_4,P1_5_1,P1_5_2,P1_5_3,P2_1,P2_2,P2_3,...,P4_1_6,P4_1_6_1,P4_1_6_2,P4_2_1,P4_2_2,P4_3,P4_4,P4_8,P5_8_2,P5_11_1
0,3,1,1,1,1,1,1,1,1,NaN,...,1,1.0,1.0,2,1,NaN,1,NaN,NaN,3.0
1,3,1,1,1,1,1,1,6,1,NaN,...,1,5.0,5.0,2,1,NaN,1,NaN,380.0,2.0
2,3,1,1,1,1,1,1,2,1,NaN,...,1,2.0,2.0,2,1,NaN,1,NaN,9999.0,1.0
3,3,1,1,1,1,1,2,9,1,NaN,...,1,8.0,8.0,2,1,NaN,1,NaN,800.0,1.0
4,3,1,1,1,1,1,2,3,1,NaN,...,1,3.0,2.0,2,1,NaN,1,NaN,NaN,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
59280,2,1,2,1,1,2,2,3,1,NaN,...,1,2.0,2.0,2,2,1.0,2,1.0,NaN,3.0
59281,2,2,2,1,1,2,2,3,1,NaN,...,1,1.0,1.0,2,2,1.0,2,1.0,NaN,3.0
59282,2,2,2,1,1,1,2,3,1,NaN,...,1,1.0,1.0,2,2,1.0,2,1.0,NaN,3.0
59283,2,3,2,1,1,2,2,1,1,NaN,...,2,NaN,NaN,2,2,1.0,2,1.0,NaN,3.0
59284,2,1,2,1,1,1,2,1,1,NaN,...,2,NaN,NaN,2,2,3.0,2,3.0,NaN,3.0

In [16]:
bruto1.isnull().sum()

P1_1            0
P1_2            0
P1_3            0
P1_4            0
P1_5_1          0
P1_5_2          0
P1_5_3          0
P2_1            0
P2_2            0
P2_3        57432
ENT             0
code            0
HOGAR           0
P4_1_1          0
P4_1_2          0
P4_1_3          0
P4_1_4          0
P4_1_5          0
P4_1_6          0
P4_1_6_1     3914
P4_1_6_2     3914
P4_2_1          0
P4_2_2          0
P4_3        26061
P4_4            0
P4_8        38669
P5_8_2      50916
P5_11_1      2483
dtype: int64

In [17]:
df = bruto1.iloc[:,[0,1,2,3,4,5,6,7,8,10,11,12,13,14,15,16,17,18,21,22,24]]
df.head()

,P1_1,P1_2,P1_3,P1_4,P1_5_1,P1_5_2,P1_5_3,P2_1,P2_2,ENT,...,HOGAR,P4_1_1,P4_1_2,P4_1_3,P4_1_4,P4_1_5,P4_1_6,P4_2_1,P4_2_2,P4_4
0,3,1,1,1,1,1,1,1,1,1,...,1,1,2,2,1,2,1,2,1,1
1,3,1,1,1,1,1,1,6,1,1,...,1,2,2,2,1,2,1,2,1,1
2,3,1,1,1,1,1,1,2,1,1,...,1,2,1,2,1,1,1,2,1,1
3,3,1,1,1,1,1,2,9,1,1,...,1,1,2,2,1,1,1,2,1,1
4,3,1,1,1,1,1,2,3,1,1,...,1,2,2,2,1,2,1,2,1,1

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59285 entries, 0 to 59284
Data columns (total 21 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   P1_1    59285 non-null  int64
 1   P1_2    59285 non-null  int64
 2   P1_3    59285 non-null  int64
 3   P1_4    59285 non-null  int64
 4   P1_5_1  59285 non-null  int64
 5   P1_5_2  59285 non-null  int64
 6   P1_5_3  59285 non-null  int64
 7   P2_1    59285 non-null  int64
 8   P2_2    59285 non-null  int64
 9   ENT     59285 non-null  int64
 10  code    59285 non-null  object
 11  HOGAR   59285 non-null  int64
 12  P4_1_1  59285 non-null  int64
 13  P4_1_2  59285 non-null  int64
 14  P4_1_3  59285 non-null  int64
 15  P4_1_4  59285 non-null  int64
 16  P4_1_5  59285 non-null  int64
 17  P4_1_6  59285 non-null  int64
 18  P4_2_1  59285 non-null  int64
 19  P4_2_2  59285 non-null  int64
 20  P4_4    59285 non-null  int64
dtypes: int64(20), object(1)
memory usage: 10.0+ MB

In [19]:
df.to_csv('vivienda_hogar_limpio.csv')

In [14]:
bruto.duplicated().sum()

1181501

In [15]:
sin_duplicados=bruto.drop_duplicates()

In [16]:
sin_duplicados.to_csv('sin_duplicados.csv')

In [2]:
df_con_nulos = pd.read_csv('sin_duplicados.csv')

In [3]:
df_con_nulos.isnull().sum()

Unnamed: 0           0
UPM                  0
PAREN                0
SEXO                 0
EDAD                 0
P3_7           3153581
NIVEL          3153581
GRADO          3153581
P3_9_1         3153581
P3_9_2         3153581
P3_9_3         3153581
UPM_DIS              0
EST_DIS              0
DOMINIO              0
TLOC                 0
ESTRATO              0
ENT                  0
VIV_SEL_3            0
P1_1                 0
P1_2                 0
P1_3                 0
P1_4                 0
P1_5_1               0
P1_5_2               0
P1_5_3               0
P2_1                 0
P2_2                 0
P2_3          37751864
VIV_SEL_4            0
HOGAR                0
P4_1_1               0
P4_1_2               0
P4_1_3               0
P4_1_4               0
P4_1_5               0
P4_1_6               0
P4_1_6_1       3627316
P4_1_6_2       3627316
P4_2_1               0
P4_2_2               0
P4_3          12192165
P4_4                 0
P4_8          19821138
P5_8_2        36147694
P5_11_1        2469283
dtype: int64

In [4]:
df = df_con_nulos.iloc[:,[1,2,3,4,11,12,14,15,16,17,18,19,20,21,22,23,24,25,26,28,29,30,31,32,33,34,35,38,39,41]]
df.head()

,UPM,PAREN,SEXO,EDAD,UPM_DIS,EST_DIS,TLOC,ESTRATO,ENT,VIV_SEL_3,...,HOGAR,P4_1_1,P4_1_2,P4_1_3,P4_1_4,P4_1_5,P4_1_6,P4_2_1,P4_2_2,P4_4
0,100023,1,2,41,1,7,1,3,1,1,...,1,1,2,2,1,2,1,2,1,1
1,100023,1,2,41,1,7,1,3,1,1,...,1,2,2,2,1,2,1,2,1,1
2,100023,1,2,41,1,7,1,3,1,1,...,1,2,1,2,1,1,1,2,1,1
3,100023,1,2,41,1,7,1,3,1,1,...,1,1,2,2,1,1,1,2,1,1
4,100023,1,2,41,1,7,1,3,1,1,...,1,2,2,2,1,2,1,2,1,1

In [5]:
df.to_csv('df.csv')

In [3]:
df = pd.read_csv('df.csv')

In [9]:
df.count()

Unnamed: 0    38401592
UPM           38401592
PAREN         38401592
SEXO          38401592
EDAD          38401592
UPM_DIS       38401592
EST_DIS       38401592
TLOC          38401592
ESTRATO       38401592
ENT           38401592
VIV_SEL_3     38401592
P1_1          38401592
P1_2          38401592
P1_3          38401592
P1_4          38401592
P1_5_1        38401592
P1_5_2        38401592
P1_5_3        38401592
P2_1          38401592
P2_2          38401592
VIV_SEL_4     38401592
HOGAR         38401592
P4_1_1        38401592
P4_1_2        38401592
P4_1_3        38401592
P4_1_4        38401592
P4_1_5        38401592
P4_1_6        38401592
P4_2_1        38401592
P4_2_2        38401592
P4_4          38401592
dtype: int64

In [13]:
q1=ps.sqldf("SELECT * FROM df WHERE UMP == 100023 LIMIT 10", locals())

KeyboardInterrupt:

[0            True
 1            True
 2            True
 3            True
 4            True
             ...
 38401587    False
 38401588    False
 38401589    False
 38401590    False
 38401591    False
 Name: UPM, Length: 38401592, dtype: bool]